"=========Переменные========="
# это ссылки на ячейки памяти где находятся какие то данные для дальнейшего использования их при обращении к названию переменной

name = "Nur"
age = 20 


"======правила======"
a=10 #можно но не понятно"
# 1name = `nchcjdnd` нельязя начинать с символа 
my_name = "kjshbcduh" # можно "_"
#my-name = так нельзя 
# if = нельзя называть ключевыми словами (if, class, def, while, for)

"===========стили написания =============="
my_name = "djndhb" #разделение слов только "_"

"ввод данных"


print(my_name)
print(20)
print("sdjhfbjhgb")
"========комментарий========="

#1) при помощи '#'
#2) при помощи 





#input-функция ввода 
number = input('введите число')
print('введенное число: ')




"типы данных "
"""
изменяемые и неизменяемые 
И:list(список), dict(словари), set(множества)
НИ: int(числа), float/decimal (числа с плавающей точкой), tuple(числа), str(строки), bool(True/false), none(пустота)
"""


#Изм
list_ = (1,2, #true,'hello')
dict_ = {'name': 'Nur', 1: 'a'}
set_= {1,2,3, true, false}

#неизм
int_=12
float_=12.12
str_="hello"
tuple_= (1,2,3,4)
bool1 = #true
bool2 = #false
none = None 



print ('изменяемые:', list_, dict_, set_)
print ('неизменяемые:int_')